uhnp/src/InformationRegisters/ЗначенияКотировокФИ/ЗначенияКотировокФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияКотировокФИ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>DefinedType.ТипЗначениеКотировки</types>
    </type>
  </resources>
  <attributes>
    <name>КолонкаКотировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>DefinedType.ИсточникКотировки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыКотировокФинансовыхИнструментов/ТипыКотировокФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКотировокФинансовыхИнструментов</name>
  <enumValues>
    <name>КурсВалюты</name>
    <comment>Указывается валюта</comment>
  </enumValues>
  <enumValues>
    <name>РыночнаяСтавкаПроцента</name>
    <comment>указывается страна</comment>
  </enumValues>
  <enumValues>
    <name>БанковскаяКотировка</name>
    <comment>Указывается банк-контрагент</comment>
  </enumValues>
  <enumValues>
    <name>БанковскаяСтавкаПроцента</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКотировкаЦеннойБумаги</name>
  </enumValues>
  <enumValues>
    <name>КотировкаЦеннойБумаги</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ЗначенияКотировокФИ/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОписание();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидКотировкиПриИзменении(Элемент)
	ОбновитьОписание();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОписание()
	
	Если ТипЗнч(Запись.ВидКотировки) <> Тип("СправочникСсылка.ВидыКотировокФинансовыхИнструментов") Тогда		
		Элементы.ДекорацияОписание.Заголовок = "";
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияОписание.Заголовок = Справочники.ВидыКотировокФинансовыхИнструментов.ПолучитьОписаниеЗначенияКотировки(Запись.ВидКотировки);
	
	Элементы.Кратность.Видимость = (Запись.ВидКотировки.ТипКотировки = Перечисления.ТипыКотировокФинансовыхИнструментов.КурсВалюты);
	
КонецПроцедуры

#КонецОбласти
